#include "inventorychanger.h"
#include "parser.h"
#include <set>
#include "protobuf/Protobuffs.h"
#include "protobuf/ProtoWriter.h"
#include "protobuf/Messages.h"
#include "steam/steam_api.h"
#include "../../SDK/Utils/Enums.hpp"
#include "../../SDK/Globals.hpp"
#include <Psapi.h>
#include <d3dx9.h>
#pragma comment (lib, "d3dx9.lib")

#include "../Tools/Obfuscation/XorStr.hpp"

inline static auto buildTexturePath = [](std::string weapon, skinInfo* item) -> std::string {
	if (item)
	{
		std::string name = _S( "resource/flash/econ/default_generated/" );
		if (strstr(weapon.c_str(), _S("gloves")) || strstr(weapon.c_str(), _S("leather_handwraps")))
		{
			if (strstr(weapon.c_str(), _S("leather_handwraps")))
				name += _S("leather_handwraps");
			else
				name += weapon;
		}
		else
		{
			name += _S("weapon_");
			name += weapon;
		}

		name += "_";
		name += std::string(item->cdnName);	
		name += _S("_light_large.png");
		return name;
	}
	else
	{
		if (strstr(weapon.c_str(), "customplayer"))
			return _S("resource/flash/econ/characters/") + weapon + _S(".png");

		else if (strstr(weapon.c_str(), _S("studded_bloodhound_gloves")))
			return _S("resource/flash/econ/default_generated/studded_bloodhound_gloves_bloodhound_guerrilla_light_large.png");

		else if (strstr(weapon.c_str(), _S("sporty_gloves")))
			return _S("resource/flash/econ/default_generated/sporty_gloves_sporty_light_blue_light_large.png");

		else if (strstr(weapon.c_str(), _S("slick_gloves")))

		int _StickerAtributeValue = ctickers[j];
		auto StickerAtributeValue = std::string{ reinterpret_cast<const char*>((void*)&_StickerAtributeValue), 4 };

		ProtoWriter WearAttribute(3);
		WearAttribute.add(Field(CSOEconItemAttribute::def_index, TYPE_UINT32, (int64_t)113 + 4 * j));
		WearAttribute.add(Field(CSOEconItemAttribute::value_bytes, TYPE_STRING, StickerAtributeValue));
		item.add(Field(CSOEconItem::attribute, TYPE_STRING, WearAttribute.serialize()));


		float _AttributeValue = 1.0f;
		auto AttributeValue = std::string{ reinterpret_cast<const char*>((void*)&_AttributeValue), 4 };

		ProtoWriter Attribute(3);
		Attribute.add(Field(CSOEconItemAttribute::def_index, TYPE_UINT32, (int64_t)115 + 4 * j));
		Attribute.add(Field(CSOEconItemAttribute::value_bytes, TYPE_STRING, AttributeValue));
		item.add(Field(CSOEconItem::attribute, TYPE_STRING, Attribute.serialize()));


		//item.attribute().add(make_econ_item_attribute(113 + 4 * j, uint32_t(289 + j))); // Sticker Kit
		//item.attribute().add(make_econ_item_attribute(114 + 4 * j, float(0.001f)));     // Sticker Wear
		//item.attribute().add(make_econ_item_attribute(115 + 4 * j, float(1.f)));        // Sticker Scale
		//item.attribute().add(make_econ_item_attribute(116 + 4 * j, float(0.f)));        // Sticker Rotation
	}







	object.add(Field(SubscribedType::object_data, TYPE_STRING, item.serialize()));
}

uint8_t* ssdgfadefault(HMODULE hModule, const char* szSignature)
{
	static auto pattern_to_byte = [](const char* pattern) {
		auto bytes = std::vector<int>{};
		auto start = const_cast<char*>(pattern);
		auto end = const_cast<char*>(pattern) + strlen(pattern);

		for (auto current = start; current < end; ++current) {
			if (*current == '?') {
				++current;
				if (*current == '?')
					++current;
				bytes.push_back(-1);
			}
			else {
				bytes.push_back(strtoul(current, &current, 16));
			}
		}
		return bytes;
	};

	//auto Module = GetModuleHandleA(szModule);

	auto dosHeader = (PIMAGE_DOS_HEADER)hModule;
	auto ntHeaders = (PIMAGE_NT_HEADERS)((std::uint8_t*)hModule + dosHeader->e_lfanew);

	auto sizeOfImage = ntHeaders->OptionalHeader.SizeOfImage;
	auto patternBytes = pattern_to_byte(szSignature);
	auto scanBytes = reinterpret_cast<std::uint8_t*>(hModule);

	auto s = patternBytes.size();
	auto d = patternBytes.data();

	for (auto i = 0ul; i < sizeOfImage - s; ++i) {
		bool found = true;
		for (auto j = 0ul; j < s; ++j) {
			if (scanBytes[i + j] != d[j] && d[j] != -1) {
				found = false;
				break;
			}
		}
		if (found) {
			return &scanBytes[i];
		}
	}

	return nullptr;
};

template<class T>
static T* FindHudElement(const char* name)
{
	static auto pThis = *reinterpret_cast<DWORD**>(ssdgfadefault(GetModuleHandleA(_S("client.dll")), _S(("B9 ? ? ? ? E8 ? ? ? ? 8B 5D 08"))) + 1);

	static auto find_hud_element = reinterpret_cast<DWORD(__thiscall*)(void*, const char*)>(ssdgfadefault(GetModuleHandleA(_S("client.dll")), _S("55 8B EC 53 8B 5D 08 56 57 8B F9 33 F6 39 77 28")));
	return (T*)find_hud_element(pThis, name);
}

struct hud_weapons_t {
	std::int32_t* get_weapon_count() {
		return reinterpret_cast<std::int32_t*>(std::uintptr_t(this) + 0x80);
	}
};



void Inventory::force_full_update()
{
	static auto fn = reinterpret_cast<std::int32_t(__thiscall*)(void*, std::int32_t)>(ssdgfadefault(GetModuleHandleA(_S("client.dll")), _S(("55 8B EC 51 53 56 8B 75 08 8B D9 57 6B FE 2C"))));
	
	auto element = FindHudElement<std::uintptr_t*>(_S(("CCSGO_HudWeaponSelection")));

	auto hud_weapons = reinterpret_cast<hud_weapons_t*>(std::uintptr_t(element) - 0xA0);

	if (hud_weapons == nullptr)
		return;

	if (!*hud_weapons->get_weapon_count())
		return;

	for (std::int32_t i = 0; i < *hud_weapons->get_weapon_count(); i++)
		i = fn(hud_weapons, i);


}

bool Inventory::Presend(uint32_t& unMsgType, void* pubData, uint32_t& cubData)
{
	uint32_t MessageType = unMsgType & 0x7FFFFFFF;
	if (MessageType == k_EMsgGCAdjustItemEquippedState) {

		ProtoWriter msg((void*)((DWORD)pubData + 8), cubData - 8, 19);

		if (!msg.has(CMsgAdjustItemEquippedState::item_id)
			|| !msg.has(CMsgAdjustItemEquippedState::new_class)
			|| !msg.has(CMsgAdjustItemEquippedState::new_slot))
			return true;

		



		uint32_t item_id = msg.get(CMsgAdjustItemEquippedState::item_id).UInt32();
		uint32_t new_class = msg.get(CMsgAdjustItemEquippedState::new_class).UInt32();
		
		if (item_id > 200000)
		{
			for (auto& f : g_MedalSkins)
				f.second.equip_state = 0;


			auto medals = g_MedalSkins[item_id];
			g_MedalSkins[item_id].equip_state = 1;
		}
		

		if (item_id > 20000 && item_id < 200000)
		{
			auto weapon = g_InventorySkins[item_id];

			if (new_class == 2)
			{
				for (auto& skins : g_InventorySkins)
				{
					if (Protobuffs::GetSlotID(skins.second.wId) == Protobuffs::GetSlotID(weapon.wId))
						skins.second.m_bInUseT = false;
				}
				g_InventorySkins[item_id].m_bInUseT = true;
				
			
			}
			else if (new_class == 3)
			{
				for (auto& skins : g_InventorySkins)
				{
					if (Protobuffs::GetSlotID(skins.second.wId) == Protobuffs::GetSlotID(weapon.wId))
						skins.second.m_bInUseCT = false;
				}

				g_InventorySkins[item_id].m_bInUseCT = true;
			
			
			}
		}


		g_Globals.m_Interfaces.m_EngineClient->ExecuteClientCmd(_S("econ_clear_inventory_images"));

		write.SendClientHello();
		write.SendMatchmakingClient2GCHello();

		g_Globals.m_Interfaces.m_ClientState->m_nDeltaTick() = -1;
		force_full_update();

		return false;
	}
	return true;
}

void ParseMedals()
{
	valve_parser::Document items_document;
	bool item_document_loaded = items_document.Load(_S(".\\csgo\\scripts\\items\\items_game.txt"), valve_parser::ENCODING::UTF8);
	if (!item_document_loaded)
		return;

	auto items = items_document.BreadthFirstSearch(_S("items"));
	if (!items || !items->ToObject())
		return;

	int i = 0;

	for (auto child : items->children)
	{
		if (child->ToObject())
		{
			std::string object_id = child->ToObject()->name.toString();

			if ((atoi(object_id.c_str()) >= 874) && (atoi(object_id.c_str()) <= 6133))
			{
				std::string object_prefab = child->ToObject()->GetKeyByName(_S("prefab"))->ToKeyValue()->Value.toString();

				if ((object_prefab != _S("collectible_untradable")) && (object_prefab != _S("operation_coin")) && (object_prefab != _S("prestige_coin"))
					&& (object_prefab != _S("attendance_pin")) && (object_prefab != _S("commodity_pin")) && (object_prefab != _S("season1_coin"))
					&& (object_prefab != _S("season2_coin")) && (object_prefab != _S("season3_coin")) && (object_prefab != _S("season4_coin"))
					&& (object_prefab != _S("season5_coin")) && (object_prefab != _S("season6_coin")) && (object_prefab != _S("season7_coin"))
					&& (object_prefab != _S("season8_coin"))) continue;

				std::string object_name = child->ToObject()->GetKeyByName(_S("name"))->ToKeyValue()->Value.toString();


				fosso[atoi(object_id.c_str())] = { object_name, atoi(object_id.c_str()) };

				i++;
				if ((atoi(object_id.c_str()) == 6133))
					break;
			}
		}
	}

	//for (size_t i = 0; i < G::MedalMap.size(); i++)
	//{
	//	G::MedalList.push_back(G::MedalMap.at(i).medal_name.c_str());
	//}
}

namespace fzdetail
{
	constexpr auto process_pattern_byte(const std::pair<char, char> pair) -> std::pair<std::uint8_t, bool>
	{
		return { std::uint8_t(pair.first), pair.second == 'x' };
	}

	template <std::size_t N>
	constexpr auto select_pattern_byte(const char(&pattern)[N], const char(&mask)[N], std::size_t n) -> std::pair<char, char>
	{
		return { pattern[n], mask[n] };
	}

	template <typename>
	struct sig_processor {};

	template <std::size_t... Indices>
	struct sig_processor<std::index_sequence<Indices...>>
	{
		template <std::size_t N>
		static constexpr auto process(const char(&pattern)[N], const char(&mask)[N])->std::array<std::pair<std::uint8_t, bool>, N>
		{
			return { process_pattern_byte(select_pattern_byte(pattern, mask, Indices))... };
		}
	};
}

auto get_module_info(const char* module_name) -> std::pair<std::uintptr_t, std::size_t>
{
	const auto module = GetModuleHandleA(module_name);
	if (!module)
		return { 0, 0 };
	MODULEINFO module_info;
	K32GetModuleInformation(GetCurrentProcess(), module, &module_info, sizeof(MODULEINFO));
	return { std::uintptr_t(module_info.lpBaseOfDll), module_info.SizeOfImage };
}



template <std::size_t N>
auto find_pattern(const char* module_name, const char(&pattern)[N], const char(&mask)[N]) -> std::uintptr_t
{
	const std::array<std::pair<std::uint8_t, bool>, N> signature = fzdetail::sig_processor<std::make_index_sequence<N>>::process(pattern, mask);

	const auto info = get_module_info(module_name);
	const auto address = reinterpret_cast<std::uint8_t*>(info.first);
	const auto size = info.second;

	const auto ret = std::search(address, address + size, signature.begin(), signature.end(),
		[](std::uint8_t curr, std::pair<std::uint8_t, bool> curr_pattern)
		{
			return (!curr_pattern.second) || curr == curr_pattern.first;
		});

	return ret == address + size ? 0 : std::uintptr_t(ret);
}

template <typename Key, typename Value>
struct Node_t
{
	int previous_id;		//0x0000
	int next_id;			//0x0004
	void* _unknown_ptr;		//0x0008
	int _unknown;			//0x000C
	Key key;				//0x0010
	Value value;			//0x0014
};


template <typename Key, typename Value>
struct Head_t
{
	Node_t<Key, Value>* memory;		//0x0000
	int allocation_count;			//0x0004
	int grow_size;					//0x0008
	int start_element;				//0x000C
	int next_available;				//0x0010
	int _unknown;					//0x0014
	int last_element;				//0x0018
}; //Size=0x001C

// could use CUtlString but this is just easier and CUtlString isn't needed anywhere else
struct String_t
{
	char* buffer;	//0x0000
	int capacity;	//0x0004
	int grow_size;	//0x0008
	int length;		//0x000C
}; //Size=0x0010

class CCStrike15ItemSystem;
class CCStrike15ItemSchema;
struct CPaintKit
{
	int id;						//0x0000

	String_t name;				//0x0004
	String_t description;		//0x0014
	String_t item_name;			//0x0024
	String_t material_name;		//0x0034
	String_t image_inventory;	//0x0044

	char pad_0x0054[0x8C];		//0x0054
}; //Size=0x00E0

struct CStickerKit
{
	int id;

	int item_rarity;

	String_t name;
	String_t description;
	String_t item_name;
	String_t material_name;
	String_t image_inventory;

	int tournament_event_id;
	int tournament_team_id;
	int tournament_player_id;
	bool is_custom_sticker_material;

	float rotate_end;
	float rotate_start;

	float scale_min;
	float scale_max;

	float wear_min;
	float wear_max;

	String_t image_inventory2;
	String_t image_inventory_large;

	std::uint32_t pad0[4];
};
auto zget_export(const char* module_name, const char* export_name) -> void*
{
	HMODULE mod;
	while (!((mod = GetModuleHandleA(module_name))))
		Sleep(100);

	return reinterpret_cast<void*>(GetProcAddress(mod, export_name));
}

struct skin_info
{
	int seed = -1;
	int paintkit;
	int rarity = 0;
	std::string tag_name;
	std::string cdn_name;
};
void Inventory::ParseSkins() const
{
	parser::parse();
